import React from "react";
import { StyleSheet, Text, ScrollView, View } from "react-native";

const Terms = () => {
  return (
    <ScrollView
      style={{
        marginHorizontal: 20,
        marginVertical: 5,
        flexDirection: "column",
      }}
      showsVerticalScrollIndicator={false}
    >
      <Text
        style={{
          fontSize: 24,
          fontWeight: "bold",
          textAlign: "center",
          marginVertical: 20,
        }}
      >
        ihelp Magazine “ҮЙЛЧИЛГЭЭНИЙ НӨХЦӨЛ”
      </Text>
      <View>
        <Text style={styles.headerText}>Нэг. Нийтлэг зүйл</Text>

        <Text style={styles.aguulga}>
          {" "}
          1. “ihelp Magazine” гэж дотоод болон гадаадын шинэ шинэлэг, оюуны
          хөрөнгө оруулалт болж буй хувь хүн болон карьер хөгжлийн бүхий л
          төрлийн мэдээллийг цахим болон хэвлэмлээр хүргэж буй сэтгүүл юм.
        </Text>

        <Text style={styles.aguulga}>
          {" "}
          2. “ihelp Magazine” нь хараат бусаар өөрийн цахим платформ болон
          хэвлэмэл сэтгүүлд мэдээ, мэдээлэл, зар сурталчилгааг байршуулна.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          3. Хэрэглэгч “ihelp Magazine” платформын үйлчилгээний энэхүү нөхцөлийг
          хүлээн зөвшөөрөөгүй бол бүртгүүлэхгүй байх, платформыг ашиглахаа
          зогсоох, аппликейшнийг устгахыг зөвлөж байна.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          4. “ihelp Magazine”-ийн үйлчилгээг авах явцад “ihelp” болон
          Хэрэглэгчийн хувийн мэдээллийг хүний нөөцийн мэдээлэл бэлтгэх
          зорилгоор хадгалах, боловсруулахыг зөвшөөрсөн болно.{" "}
        </Text>

        <Text style={styles.aguulga}>
          {" "}
          5. Хэрэглэгчийг таньж мэдэх, баталгаажуулах зорилгоор “ihelp
          Magazine”-ийн хүсэлтээр өөрийн хувийн мэдээллийг өгөх, имэйл хаяг
          зэрэг Хэрэглэгчийн мэдээллийг авч, баталгаажуулахыг хүлээн зөвшөөрсөн
          болно.
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          6. “ihelp Magazine” нь залилан мэхлэх үйлдлийг шалгах, Үйлчилгээний
          нөхцөл, Нууцын бодлогын хэрэгжилтийг хангах, эрсдэлээс урьдчилан
          сэргийлэх зорилгоор “ihelp Magazine” дэх Хэрэглэгчдийн мэдээллийг
          татан авч үзэх, шалгах эрхтэй байна.{" "}
        </Text>
        <Text style={styles.headerText}>Хоёр. Хэрэглэгчийн эрх, үүрэг</Text>
        <Text style={styles.aguulga}>
          {" "}
          1. Үйлчилгээний нөхцөлийг хүлээн зөвшөөрөөгүй тохиолдолд ihelp-д
          бүртгэл үүсгэхгүй, үйлчилгээ авахгүй байх эрхтэй.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          2. Хэрэглэгч хэдийд ч “ihelp Magazine”-ийг ашиглахаа болих, бүртгэлээ
          устгуулах эрхтэй.
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          3. Хэрэглэгч нь “ihelp Magazine”-ийн талаар санал, гомдол, хүсэлт
          зэргийг ihelp-ийн сошиал хаягуудаар болон info@ihelp.mn цахим хаягаар
          чөлөөтэй илэрхийлэх, илгээх эрхтэй.
        </Text>

        <Text style={styles.aguulga}>
          {" "}
          4. Хэрэглэгч “ihelp Magazine”-д нэвтрэх нэр, цахим шуудан болон нууц
          үгийг нууцлах үүрэгтэй ба бусдад өөрийн аккаунтаар нэвтрэх, ашиглах
          боломж олгохгүй байж, хувийн мэдээллийн аюулгүй байдлыг хангах
          үүрэгтэй.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          5. Хэрэглэгч нь “ihelp Magazine”-ээс олж авсан мэдээллээ аливаа нэг
          шийдвэр гаргах зэрэг хувьдаа ашиглахдаа тохиолдолд үр дүнг нь өөрөө
          хариуцах үүрэгтэй.{" "}
        </Text>
        <Text style={styles.headerText}>Гурав. Төлбөрийн нөхцөл</Text>

        <Text style={styles.aguulga}>
          {" "}
          1. “ihelp Magazine” нь үнэ төлбөргүйгээр цахим сүлжээнд байршина.
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          2. “ihelp Magazine”-ийг бэлэн сэтгүүл хэлбэрээр хүргүүлж авах
          тохиолдолд дугаар бүрийн үнэ ... төгрөг байна.{" "}
        </Text>
        <Text style={styles.headerText}>Дөрөв. Өмчлөх эрх</Text>
        <Text style={styles.aguulga}>
          {" "}
          1. “ihelp Magazine” нийтлэгдэж байгаа мэдээ, мэдээллүүд нь “Новелист”
          ХХК-ийн өмч болно.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          2. “ihelp Magazine”-д нийтлэгдсэн мэдээ, мэдээллийг зөвшөөрөлгүйгээр
          бусдад дамжуулах, хуулбарлан түгээхийг хориглоно.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          3. “ihelp Magazine” нь Новелист ХХК-ийн өмч бөгөөд энэхүү платформын
          лого, нэр, бүтэц, загвар, схем, програмчлал, дизайн, шийдэл, видео,
          зураг, хөдөлгөөнт зураг, контент, үйлчилгээ, тэмдэглэгээг хуулах,
          олшруулах, дуурайх, бусад хэлбэрээр ашиглах болон бусад этгээдийн
          зүгээс ашиг олох зорилгоор ашиглахыг хориглоно.{" "}
        </Text>
        <Text style={styles.headerText}>Тав. Хариуцлага</Text>
        <Text style={styles.aguulga}>
          {" "}
          1. Хэрэглэгч өөрийн үүргээ үл биелүүлж Үйлчилгээний нөхцөлтэй
          танилцаагүй нь Үйлчилгээний нөхцөл, түүний аливаа заалтыг танилцаагүй,
          мэдээгүй, ойлгоогүй гэж үзэх үндэслэл болохгүй бөгөөд хэрэглэгчийг
          аливаа үүрэг, хариуцлагаас чөлөөлөх үндэслэл болохгүй.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          2. “ihelp Magazine” сэтгүүл дээрх мэдээллүүд нь хэрэглэгчийн аливаа
          шийдвэр, хувийн амьдралд нөлөөлөх, өөрчлөлт оруулах зэрэгт “Новелист
          ХХК” хариуцлага хүлээхгүй болно.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          3. Энэхүү Үйлчилгээний нөхцөл болон Монгол улсад хүчин төгөлдөр
          үйлчилж буй хууль тогтоомжийг зөрчсөн тохиолдолд ihelp нь тухайн
          хэрэглэгчийн эрхийг хасах, бүртгэлийг устгах, цаашлаад үйлчилгээ
          үзүүлэхээ зогсоох эрхтэй бөгөөд тухайн хэрэглэгчтэй холбоотой
          мэдээллийг хуулийн байгууллагын зүгээс шаардсан тохиолдолд холбогдох
          байгууллагад шилжүүлэх эрхтэй байна.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          4. “Новелист” ХХК-ийн оюуны өмчийн эрх зөрчигдсөн тохиолдолд холбогдох
          этгээдэд Оюуны өмчийн тухай хууль, Зөрчлийн тухай хууль, Эрүүгийн
          тухай хууль болон бусад хуульд заасан хариуцлага хүлээлгэнэ.{" "}
        </Text>
        <Text style={styles.headerText}>Зургаа. Бусад нөхцөл</Text>
        <Text style={styles.aguulga}>
          {" "}
          1. “ihelp Magazine”-ийн хэвийн ажиллагаа, түүний аюулгүй байдал,
          мэдээллийн нууцлалыг “Новелист” ХХК бүрэн хариуцна.{" "}
        </Text>

        <Text style={styles.aguulga}>
          {" "}
          2. “ihelp Magazine”-д доголдол, гэмтэл, тасалдал гарсан тохиолдолд бид
          доголдлыг боломжит богино хугацаанд хурдан засварлах арга хэмжээг
          авна.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          3. “ihelp Magazine” нь нэг талын санаачилгаар үйлчилгээний нөхцөлдөө
          бүхлээр буюу хэсэгчлэн нэмэлт, өөрчлөлт оруулах эрхтэй бөгөөд
          шаардлагатай тохиолдолд энэ талаараа мэдэгдэл гаргана.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          4. Хэрэглэгч нь энэ зүйлийн “2.3.1”-д заасан нэмэлт, өөрчлөлтийг
          хүлээн зөвшөөрөөгүй тохиолдолд өөрийн бүртгэлийг устгаж, ihelp.mn-ээс
          авч буй үйлчилгээгээ зогсоох эрхтэй.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          5. Хэрэглэгч бүртгэлээ устгаагүй тохиолдолд энэ зүйлийн “2.3.1”-д
          заасан нэмэлт, өөрчлөлтийг хүлээн зөвшөөрсөн гэж үзнэ.{" "}
        </Text>

        <Text style={styles.aguulga}>
          {" "}
          6. Хэрэглэгч нь ihelp.mn-ийг цаашид ашиглахгүй тохиолдолд өөрийн
          бүртгэл/аккаунтыг хэдийд ч хаах эрхтэй. Хэрэглэгч өөрийн аккаунтыг
          хаах нь “ihelp”-д хадгалагдаж буй бүх мэдээллийг устгах үндэслэл
          болохгүй.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          7. “ihelp Magazine” нь үйлчилгээгээ бүхэлд нь, эсхүл хэсэгчлэн
          түдгэлзүүлэх, зогсоох, өөрчлөх эрхтэй байна.{" "}
        </Text>
        <Text style={styles.aguulga}>
          {" "}
          8. “ihelp Magazine”-ийн үйлчилгээний талаар худал, гүтгэсэн,
          доромжилсон, тэдний нэр хүндэд халдсан агуулгатай мэдээлэл оруулах,
          тараахыг хориглоно.{" "}
        </Text>
        <Text style={styles.footer}>
          {" "}
          Үйлчилгээний нөхцөлийг зөрчсөн аливаа нэг зөрчил илэрсэн тохиолдолд
          Үйлчилгээний нөхцөлийн арав дахь хэсэгт заасан хариуцлага болон Монгол
          улсын хүчин төгөлдөр үйлчилж буй хууль тогтоомжоор шийдвэрлэнэ.
        </Text>
      </View>
    </ScrollView>
  );
};

export default Terms;

const styles = StyleSheet.create({
  headerText: {
    fontWeight: "bold",
    fontSize: 16,
    textAlign: "center",
    paddingVertical: 10,
  },
  aguulga: {
    fontSize: 14,
    paddingVertical: 5,
  },
  footer: {
    fontSize: 15,
    paddingVertical: 30,
    textAlign: "center",
  },
});
